Revit 2024 API
DataConversionMonitorScope Constructor
 The only constructor. Expects a valid pointer to IDataConversionMonitor.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public DataConversionMonitorScope(
	IDataConversionMonitor IDCM
)
Visual Basic
Public Sub New ( _
	IDCM As IDataConversionMonitor _
)
Visual C++
public:
DataConversionMonitorScope(
	IDataConversionMonitor^ IDCM
)
Parameters
IDCM
Type: Autodesk.Revit.DB.IDataConversionMonitor
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
DataConversionMonitorScope Class
Autodesk.Revit.DB Namespace